app/controllers/users_controller.rb

  def set_user
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)

  def index
    @users = if params[:show_banned]
               User.order('username ASC')
             else
               User.active.order('username ASC')
             end

    respond_to do |format|
      format.html
      format.csv do
        col = %w(username first_name last_name nickname phone email affiliation)
        download_csv(User.all, col, "users_#{Time.zone.today}")
---
SELECT * FROM "users"

  def create # rubocop:disable all
    @user = User.new(user_params)
    @user.role = 'normal' if user_params[:role].blank?
    @user.view_mode = @user.role
    # if we're using CAS
    if @cas_auth
      # pull from our CAS hackery if you're not an admin/superuser creating a
      # new user
      if current_user && can?(:manage, Reservation)
        @user.cas_login = user_params[:username]
      else
        @user.cas_login = session[:new_username]
        @user.username = @user.cas_login
      end
    else
      # if not using CAS, just put the e-mail as the username
      @user.username = @user.email
    end
    if @user.save
---
INSERT INTO "users" ("is_banned", "updated_at", "nickname", "is_admin", "phone", "first_name", "login", "last_name", "affiliation", "email", "created_at") VALUES('f', '2009-10-01 00:26:08', 'Ry-guy', 'f', '978-793-2292', 'Ryan', NULL, 'Laughlin', 'Saybrook 2012', 'ryan.laughlin@yale.edu', '2009-10-01 00:26:08')